// ?Объявите две переменные: admin и name.
//?Запишите строку "Джон" в переменную name.
//?Скопируйте значение из переменной name в admin.
//?Выведите на экран значение admin, используя функцию log(должна показать «Джон»).

let admin;
let name;

name = "Джон";
admin = name;

console.log(admin);


//? 1.Создайте переменную для названия нашей планеты. Как бы вы её назвали?
//? 2.Создайте переменную для хранения имени текущего посетителя сайта.Как бы вы назвали такую переменную ?

let ourEart;
let currentUserName;

//?Какие буквы (заглавные или строчные) использовать для имён констант?

// !1.заглавными буквами
//!например, мы можем хранить что-то,
//! что никогда не изменится

const WORLD_WAR_I = '28.07.1914';// например Первая мировая война

