// !===Базовые операторы, математика===
// ?Чему будут равны переменные a, b, c и d в примере ниже?
let a = 1, b = 1;

let c = ++a; // c=2,a=2
let d = b++; // d=1,b=2

// ?
let y = 2;//y=4

let x = 1 + (y *= 2);//x=5

// Какой результат будет у выражений ниже?
"" + 1 + 0 //10 string
"" - 1 + 0//-1 number
true + false // 1 + 0 = 1 number
6 / "3"//2 number
"2" * "3"//6 number
4 + 5 + "px"//9px string
"$" + 4 + 5//$45 string
"4" - 2//number
"4px" - 2 //NaN
"  -9  " + 5//-9  5 string
"  -9  " - 5//-14 number
null + 1//1 number
undefined + 1//NaN
" \t \n" - 2//-2 number

//? Ниже приведён код, который запрашивает у пользователя два числа и показывает их сумму.
//?Он работает неправильно.Код в примере выводит 12(для значения полей по умолчанию).
//?В чём ошибка ? Исправьте её.Результат должен быть 3.

// * оператор унарный + отсутствует
let num1 = prompt("Первое число?", 1);
let num2 = prompt("Второе число?", 2);

// пр.num1
//let num2 = +prompt("Второе число?", 2);


// ! ===Операторы сравнения===

// ?Каким будет результат этих выражений?

5 > 4//true
"ананас" > "яблоко"//flase
"2" > "12"//true
undefined == null//true
undefined === null//false
null == "\n0\n"//false
null === +"\n0\n"//false

// !===Условное ветвление: if, '?'===

// ?Выведется ли console?

if ("0") {
  console.log('Привет');
}
//true


//? Используя конструкцию if..else, напишите код, который будет спрашивать: „Какое «официальное» название JavaScript?“
//?Если пользователь вводит «ECMAScript», то показать: «Верно!», в противном случае – отобразить: «Не знаете ? ECMAScript!»

let questions = prompt('Какое "официальное" название JavaScript?', '');

if (questions == 'ECMAScript') {
  console.log('Верно!');
} else if (questions == 'ecmascript') {
  console.log('это не так пишется');
} else {
  console.log('Не знаете? ECMAScript!');
}

//?Используя конструкцию if..else, напишите код, который получает число через prompt, а затем выводит в log:
//?1, если значение больше нуля,
  //?-1, если значение меньше нуля,
   //? 0, если значение равно нулю.
    //?  Предполагается, что пользователь вводит только числа.

let num = +prompt('Вводите число', '');

if (num > 0) {
  console.log(1);
} else if (num < 0) {
  console.log(-1);
} else if (num === 0) {
  console.log(0);
}

//?Перепишите конструкцию if с использованием условного оператора '?':

// let result;

// if (a + b < 4) {
//   result = 'Мало';
// } else {
//   result = 'Много';
// }

let result = (a + b < 4) ? 'Мало' : 'Много';

//?Перепишите if..else с использованием нескольких операторов '?'.
//?Для читаемости рекомендуется разбить код на несколько строк.

// let message;

// if (login == 'Сотрудник') {
//   message = 'Привет';
// } else if (login == 'Директор') {
//   message = 'Здравствуйте';
// } else if (login == '') {
//   message = 'Нет логина';
// } else {
//   message = '';
// }

let message = (login == 'Сотрудник') ? 'Привет' :
  (login == 'Директор') ? 'Здравствуйте' :
    (login == '') ? 'Нет логина' : '';
