//!(2.11)======================================Логические операторы===========================================================
// ?Что выведет код ниже?

console.log(null || 2 || undefined);//2

//?Что выведет код ниже ?
console.log(console.log(1)|| 2 || console.log(3));//2

//? Что выведет код ниже?
console.log(1 && null && 2);//null

// ?Что выведет код ниже?
console.log(console.log(1) && console.log(2));//undefned

// ?Что выведет код ниже?
console.log(null || 2 && 3 || 4);//3

//?Напишите условие if для проверки, что переменная age находится в диапазоне между 14 и 90 включительно.
//?«Включительно» означает, что значение переменной age может быть равно 14 или 90.
let age=1;//false
if (age >= 14 && age <= 90){

}
// ?Напишите условие if для проверки, что значение переменной age НЕ находится в диапазоне 14 и 90 включительно.
// ?Напишите два варианта: первый с использованием оператора НЕ!, второй – без этого оператора.
if (!(age >= 14 && age <= 90)){}
  if (age < 14 || age > 90){}

// ?Какие из перечисленных ниже alert выполнятся?
//?Какие конкретно значения будут результатами выражений в условиях if (...)?

if (-1 || 0) console.log('first');//true 0
if (-1 && 0) console.log('second');//false -1
if (null || -1 && 1) console.log('third');// true 1

// ?Напишите код, который будет спрашивать логин с помощью prompt.
// ?Если посетитель вводит «Админ», то prompt запрашивает пароль, если ничего не введено или нажата клавиша Esc – показать «Отменено», в противном случае отобразить «Я вас не знаю».
// ?Пароль проверять так:
// ?Если введён пароль «Я главный», то выводить «Здравствуйте!»,
// ?Иначе – «Неверный пароль»,
// ?При отмене – «Отменено».

let user = prompt("логин !", '');

if (user === 'Админ') {

  let password = prompt('Пароль?', '');

  if (password === 'Я главный') {
    console.log('Здравствуйте!');
  } else if (password === '' || password === null) {
    console.log('Отменено');
  } else {
    console.log('Неверный пароль');
  }

} else if (user === '' || user === null) {
  console.log('Отменено');
} else {
  console.log("Я вас не знаю");
}



// !(2.13)================================================Циклы while и for====================================================
// ?Какое последнее значение выведет этот код? Почему?
let i = 3;
//i =3,i=2,i=1,i=0;end Нету условия нету Цикл

while (i) {
  console.log(i--);
}//0

// ?Для каждого цикла запишите, какие значения он выведет. Потом сравните с ответом.
//?Оба цикла выводят log с одинаковыми значениями или нет ?

let a = 0;
while (++a < 5) console.log(a);//4

let z = 0;
while (z++ < 5) console.log(z);//5

// ?Для каждого цикла запишите, какие значения он выведет. Потом сравните с ответом.
//?Оба цикла выведут log с одинаковыми значениями или нет ?

for (let i = 0; i < 5; i++) console.log(i);//0-4

for (let i = 0; i < 5; ++i) console.log(i);//0-4

// ?При помощи цикла for выведите чётные числа от 2 до 10.
for (let i = 2; i <= 10; i++) {
  if (i % 2 == 0) {
    console.log(i);
  }
}

// ?Перепишите код, заменив цикл for на while, без изменения поведения цикла.
for (let i = 0; i < 3; i++) {
  console.log(`numbers ${i}!`);
}

let x = 0;
while (x < 3) {
  alert(`number ${i}!`);
  x++;
}

// ?Напишите цикл, который предлагает prompt ввести число, большее 100. Если посетитель ввёл другое число – попросить ввести ещё раз, и так далее.
// ?Цикл должен спрашивать число пока либо посетитель не введёт число, большее 100, либо не нажмёт кнопку Отмена(ESC).
// ?Предполагается, что посетитель вводит только числа.Предусматривать обработку нечисловых строк в этой задаче необязательно.
let num;

do {
  num = prompt("Введите число больше 100?", 0);
} while (num <= 100 && num);


// ?Натуральное число, большее 1, называется простым, если оно ни на что не делится, кроме себя и 1.
// ?Другими словами, n > 1 – простое, если при его делении на любое число кроме 1 и n есть остаток.
  // ?Например, 5 это простое число, оно не может быть разделено без остатка на 2, 3 и 4.
// ?Напишите код, который выводит все простые числа из интервала от 2 до n.
// ?Для n = 10 результат должен быть 2, 3, 5, 7.
//P.S.Код также должен легко модифицироваться для любых других интервалов.

function naturalNumbers(n) {
  if (n > 1) {
    nextLet:
    for (let i = 2; i <= n; i++) {
      for (let j = 2; j < i; j++) {
        if (i % j == 0) {
          continue nextLet;
        }
      }
      console.log(i);
    }
  }
}
naturalNumbers(10);


// !(2.14)===========================================Конструкция "switch"=======================================================

// ?Напишите if..else, соответствующий следующему switch:
let browser=prompt('Browser','')
if (browser == 'Edge') {
  console.log("You've got the Edge!");
} else if (browser == 'Chrome'
  || browser == 'Firefox'
  || browser == 'Safari'
  || browser == 'Opera') {
  console.log('Okay we support these browsers too');
} else {
  console.log('We hope that this page looks ok!');
}

// ?Перепишите код с использованием одной конструкции switch:

const number = +prompt('Введите число между 0 и 3', '');

if (number === 0) {
  console.log('Вы ввели число 0');
}

if (number === 1) {
  console.log('Вы ввели число 1');
}

if (number === 2 || number === 3) {
  console.log('Вы ввели число 2, а может и 3');
}

switch (number) {
  case 0:
    console.log('Вы ввели число 0');
    break;
  case 0:
    console.log('Вы ввели число 1');
    break;
  case 0:
  case 0:
    console.log('Вы ввели число 2, а может и 3');
    break
  default:
    console.log('not')
    break;
}