// ?Современный JavaScript поддерживает «классы» и «модули» — продвинутые структуры языка (и мы, конечно, до них доберёмся), которые
//? автоматически включают строгий режим.
// console.log('some code');
// "use strict" ниже игнорируется - он должен быть в первой строке

// "use strict";
//? ========================================================================
'use strict'//Строгий режим 
x = 5;
console.log(5);//x is not defined

'use strict';// <Shift+ Enter для перехода на новую строку >
  //  ...ваш код...
  //<Enter для запуска>